Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/mlb.h
/*
 * Component description for MLB
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-28T20:38:26Z */
#ifndef _PIC32CZCA90_MLB_COMPONENT_H_
#define _PIC32CZCA90_MLB_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MLB                                          */
/* ************************************************************************** */

/* -------- MLB_CTRLA : (MLB Offset: 0x00) (R/W 32) MLB Wrapper Control Register -------- */
#define MLB_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_CTRLA) MLB Wrapper Control Register  Reset Value */

#define MLB_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (MLB_CTRLA) Software Reset Position */
#define MLB_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << MLB_CTRLA_SWRST_Pos)               /* (MLB_CTRLA) Software Reset Mask */
#define MLB_CTRLA_SWRST(value)                (MLB_CTRLA_SWRST_Msk & (_UINT32_(value) << MLB_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the MLB_CTRLA register */
#define MLB_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (MLB_CTRLA) MediaLB Enable (ON) bit Position */
#define MLB_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << MLB_CTRLA_ENABLE_Pos)              /* (MLB_CTRLA) MediaLB Enable (ON) bit Mask */
#define MLB_CTRLA_ENABLE(value)               (MLB_CTRLA_ENABLE_Msk & (_UINT32_(value) << MLB_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the MLB_CTRLA register */
#define MLB_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (MLB_CTRLA) Run In Standby Position */
#define MLB_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << MLB_CTRLA_RUNSTDBY_Pos)            /* (MLB_CTRLA) Run In Standby Mask */
#define MLB_CTRLA_RUNSTDBY(value)             (MLB_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << MLB_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the MLB_CTRLA register */
#define MLB_CTRLA_Msk                         _UINT32_(0x00000043)                                 /* (MLB_CTRLA) Register Mask  */


/* -------- MLB_INTENCLR : (MLB Offset: 0x10) (R/W 32) Interrupt Enable Clear Register -------- */
#define MLB_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (MLB_INTENCLR) Interrupt Enable Clear Register  Reset Value */

#define MLB_INTENCLR_INTMLB_Pos               _UINT32_(0)                                          /* (MLB_INTENCLR) MLB General Interrupt Enable Clear Position */
#define MLB_INTENCLR_INTMLB_Msk               (_UINT32_(0x1) << MLB_INTENCLR_INTMLB_Pos)           /* (MLB_INTENCLR) MLB General Interrupt Enable Clear Mask */
#define MLB_INTENCLR_INTMLB(value)            (MLB_INTENCLR_INTMLB_Msk & (_UINT32_(value) << MLB_INTENCLR_INTMLB_Pos)) /* Assigment of value for INTMLB in the MLB_INTENCLR register */
#define MLB_INTENCLR_INT0AHB_Pos              _UINT32_(1)                                          /* (MLB_INTENCLR) AHB Interrupt 0 Enable Clear Position */
#define MLB_INTENCLR_INT0AHB_Msk              (_UINT32_(0x1) << MLB_INTENCLR_INT0AHB_Pos)          /* (MLB_INTENCLR) AHB Interrupt 0 Enable Clear Mask */
#define MLB_INTENCLR_INT0AHB(value)           (MLB_INTENCLR_INT0AHB_Msk & (_UINT32_(value) << MLB_INTENCLR_INT0AHB_Pos)) /* Assigment of value for INT0AHB in the MLB_INTENCLR register */
#define MLB_INTENCLR_INT1AHB_Pos              _UINT32_(2)                                          /* (MLB_INTENCLR) AHB Interrupt 1 Enable Clear Position */
#define MLB_INTENCLR_INT1AHB_Msk              (_UINT32_(0x1) << MLB_INTENCLR_INT1AHB_Pos)          /* (MLB_INTENCLR) AHB Interrupt 1 Enable Clear Mask */
#define MLB_INTENCLR_INT1AHB(value)           (MLB_INTENCLR_INT1AHB_Msk & (_UINT32_(value) << MLB_INTENCLR_INT1AHB_Pos)) /* Assigment of value for INT1AHB in the MLB_INTENCLR register */
#define MLB_INTENCLR_Msk                      _UINT32_(0x00000007)                                 /* (MLB_INTENCLR) Register Mask  */


/* -------- MLB_INTENSET : (MLB Offset: 0x14) (R/W 32) Interrupt Enable Set Register -------- */
#define MLB_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (MLB_INTENSET) Interrupt Enable Set Register  Reset Value */

#define MLB_INTENSET_INTMLB_Pos               _UINT32_(0)                                          /* (MLB_INTENSET) MLB General Interrupt Enable Set Position */
#define MLB_INTENSET_INTMLB_Msk               (_UINT32_(0x1) << MLB_INTENSET_INTMLB_Pos)           /* (MLB_INTENSET) MLB General Interrupt Enable Set Mask */
#define MLB_INTENSET_INTMLB(value)            (MLB_INTENSET_INTMLB_Msk & (_UINT32_(value) << MLB_INTENSET_INTMLB_Pos)) /* Assigment of value for INTMLB in the MLB_INTENSET register */
#define MLB_INTENSET_INT0AHB_Pos              _UINT32_(1)                                          /* (MLB_INTENSET) AHB Interrupt 0 Enable Set Position */
#define MLB_INTENSET_INT0AHB_Msk              (_UINT32_(0x1) << MLB_INTENSET_INT0AHB_Pos)          /* (MLB_INTENSET) AHB Interrupt 0 Enable Set Mask */
#define MLB_INTENSET_INT0AHB(value)           (MLB_INTENSET_INT0AHB_Msk & (_UINT32_(value) << MLB_INTENSET_INT0AHB_Pos)) /* Assigment of value for INT0AHB in the MLB_INTENSET register */
#define MLB_INTENSET_INT1AHB_Pos              _UINT32_(2)                                          /* (MLB_INTENSET) AHB Interrupt 1 Enable Set Position */
#define MLB_INTENSET_INT1AHB_Msk              (_UINT32_(0x1) << MLB_INTENSET_INT1AHB_Pos)          /* (MLB_INTENSET) AHB Interrupt 1 Enable Set Mask */
#define MLB_INTENSET_INT1AHB(value)           (MLB_INTENSET_INT1AHB_Msk & (_UINT32_(value) << MLB_INTENSET_INT1AHB_Pos)) /* Assigment of value for INT1AHB in the MLB_INTENSET register */
#define MLB_INTENSET_Msk                      _UINT32_(0x00000007)                                 /* (MLB_INTENSET) Register Mask  */


/* -------- MLB_INTFLAG : (MLB Offset: 0x18) (R/W 32) Interrupt Status and Clear Register -------- */
#define MLB_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (MLB_INTFLAG) Interrupt Status and Clear Register  Reset Value */

#define MLB_INTFLAG_INTMLB_Pos                _UINT32_(0)                                          /* (MLB_INTFLAG) MLB General Interrupt Flag Position */
#define MLB_INTFLAG_INTMLB_Msk                (_UINT32_(0x1) << MLB_INTFLAG_INTMLB_Pos)            /* (MLB_INTFLAG) MLB General Interrupt Flag Mask */
#define MLB_INTFLAG_INTMLB(value)             (MLB_INTFLAG_INTMLB_Msk & (_UINT32_(value) << MLB_INTFLAG_INTMLB_Pos)) /* Assigment of value for INTMLB in the MLB_INTFLAG register */
#define MLB_INTFLAG_INT0AHB_Pos               _UINT32_(1)                                          /* (MLB_INTFLAG) AHB Interrupt 0 Flag Position */
#define MLB_INTFLAG_INT0AHB_Msk               (_UINT32_(0x1) << MLB_INTFLAG_INT0AHB_Pos)           /* (MLB_INTFLAG) AHB Interrupt 0 Flag Mask */
#define MLB_INTFLAG_INT0AHB(value)            (MLB_INTFLAG_INT0AHB_Msk & (_UINT32_(value) << MLB_INTFLAG_INT0AHB_Pos)) /* Assigment of value for INT0AHB in the MLB_INTFLAG register */
#define MLB_INTFLAG_INT1AHB_Pos               _UINT32_(2)                                          /* (MLB_INTFLAG) AHB Interrupt 1 Flag Position */
#define MLB_INTFLAG_INT1AHB_Msk               (_UINT32_(0x1) << MLB_INTFLAG_INT1AHB_Pos)           /* (MLB_INTFLAG) AHB Interrupt 1 Flag Mask */
#define MLB_INTFLAG_INT1AHB(value)            (MLB_INTFLAG_INT1AHB_Msk & (_UINT32_(value) << MLB_INTFLAG_INT1AHB_Pos)) /* Assigment of value for INT1AHB in the MLB_INTFLAG register */
#define MLB_INTFLAG_Msk                       _UINT32_(0x00000007)                                 /* (MLB_INTFLAG) Register Mask  */


