Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/mlb.h
/* -------- MLB_DBGCTRL : (MLB Offset: 0x1C) (R/W 32) Debug Control Register -------- */
#define MLB_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (MLB_DBGCTRL) Debug Control Register  Reset Value */

#define MLB_DBGCTRL_DBGRUN_Pos                _UINT32_(0)                                          /* (MLB_DBGCTRL) Debug Run Enable Position */
#define MLB_DBGCTRL_DBGRUN_Msk                (_UINT32_(0x1) << MLB_DBGCTRL_DBGRUN_Pos)            /* (MLB_DBGCTRL) Debug Run Enable Mask */
#define MLB_DBGCTRL_DBGRUN(value)             (MLB_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << MLB_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the MLB_DBGCTRL register */
#define MLB_DBGCTRL_Msk                       _UINT32_(0x00000001)                                 /* (MLB_DBGCTRL) Register Mask  */


/* -------- MLB_SYNCBUSY : (MLB Offset: 0x20) ( R/ 32) SYNCBUSY Register -------- */
#define MLB_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (MLB_SYNCBUSY) SYNCBUSY Register  Reset Value */

#define MLB_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (MLB_SYNCBUSY) Software Reset Synchronization Busy Position */
#define MLB_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << MLB_SYNCBUSY_SWRST_Pos)            /* (MLB_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define MLB_SYNCBUSY_SWRST(value)             (MLB_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << MLB_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the MLB_SYNCBUSY register */
#define MLB_SYNCBUSY_ENABLE_Pos               _UINT32_(1)                                          /* (MLB_SYNCBUSY) Module Enable Synchronization Busy Position */
#define MLB_SYNCBUSY_ENABLE_Msk               (_UINT32_(0x1) << MLB_SYNCBUSY_ENABLE_Pos)           /* (MLB_SYNCBUSY) Module Enable Synchronization Busy Mask */
#define MLB_SYNCBUSY_ENABLE(value)            (MLB_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << MLB_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the MLB_SYNCBUSY register */
#define MLB_SYNCBUSY_Msk                      _UINT32_(0x00000003)                                 /* (MLB_SYNCBUSY) Register Mask  */


/* -------- MLB_MLBC0 : (MLB Offset: 0x400) (R/W 32) MediaLB Control 0 Register -------- */
#define MLB_MLBC0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MLBC0) MediaLB Control 0 Register  Reset Value */

#define MLB_MLBC0_MLBEN_Pos                   _UINT32_(0)                                          /* (MLB_MLBC0) MediaLB enable Position */
#define MLB_MLBC0_MLBEN_Msk                   (_UINT32_(0x1) << MLB_MLBC0_MLBEN_Pos)               /* (MLB_MLBC0) MediaLB enable Mask */
#define MLB_MLBC0_MLBEN(value)                (MLB_MLBC0_MLBEN_Msk & (_UINT32_(value) << MLB_MLBC0_MLBEN_Pos)) /* Assigment of value for MLBEN in the MLB_MLBC0 register */
#define MLB_MLBC0_MLBCLK_Pos                  _UINT32_(2)                                          /* (MLB_MLBC0) MediaLB clock speed select Position */
#define MLB_MLBC0_MLBCLK_Msk                  (_UINT32_(0x7) << MLB_MLBC0_MLBCLK_Pos)              /* (MLB_MLBC0) MediaLB clock speed select Mask */
#define MLB_MLBC0_MLBCLK(value)               (MLB_MLBC0_MLBCLK_Msk & (_UINT32_(value) << MLB_MLBC0_MLBCLK_Pos)) /* Assigment of value for MLBCLK in the MLB_MLBC0 register */
#define   MLB_MLBC0_MLBCLK_256xFs_Val         _UINT32_(0x0)                                        /* (MLB_MLBC0) 256x Frame Speed  */
#define   MLB_MLBC0_MLBCLK_512xFs_Val         _UINT32_(0x1)                                        /* (MLB_MLBC0) 512x Frame Speed  */
#define   MLB_MLBC0_MLBCLK_1024xFs_Val        _UINT32_(0x2)                                        /* (MLB_MLBC0) 1024x Frame Speed  */
#define   MLB_MLBC0_MLBCLK_reserved_Val       _UINT32_(0x3)                                        /* (MLB_MLBC0) Only for MLBPEN==1  */
#define MLB_MLBC0_MLBCLK_256xFs               (MLB_MLBC0_MLBCLK_256xFs_Val << MLB_MLBC0_MLBCLK_Pos) /* (MLB_MLBC0) 256x Frame Speed Position  */
#define MLB_MLBC0_MLBCLK_512xFs               (MLB_MLBC0_MLBCLK_512xFs_Val << MLB_MLBC0_MLBCLK_Pos) /* (MLB_MLBC0) 512x Frame Speed Position  */
#define MLB_MLBC0_MLBCLK_1024xFs              (MLB_MLBC0_MLBCLK_1024xFs_Val << MLB_MLBC0_MLBCLK_Pos) /* (MLB_MLBC0) 1024x Frame Speed Position  */
#define MLB_MLBC0_MLBCLK_reserved             (MLB_MLBC0_MLBCLK_reserved_Val << MLB_MLBC0_MLBCLK_Pos) /* (MLB_MLBC0) Only for MLBPEN==1 Position  */
#define MLB_MLBC0_MLBPEN_Pos                  _UINT32_(5)                                          /* (MLB_MLBC0) MediaLB 6-pin enable. Position */
#define MLB_MLBC0_MLBPEN_Msk                  (_UINT32_(0x1) << MLB_MLBC0_MLBPEN_Pos)              /* (MLB_MLBC0) MediaLB 6-pin enable. Mask */
#define MLB_MLBC0_MLBPEN(value)               (MLB_MLBC0_MLBPEN_Msk & (_UINT32_(value) << MLB_MLBC0_MLBPEN_Pos)) /* Assigment of value for MLBPEN in the MLB_MLBC0 register */
#define MLB_MLBC0_MLBLK_Pos                   _UINT32_(7)                                          /* (MLB_MLBC0) MediaLB lock status (read-only) Position */
#define MLB_MLBC0_MLBLK_Msk                   (_UINT32_(0x1) << MLB_MLBC0_MLBLK_Pos)               /* (MLB_MLBC0) MediaLB lock status (read-only) Mask */
#define MLB_MLBC0_MLBLK(value)                (MLB_MLBC0_MLBLK_Msk & (_UINT32_(value) << MLB_MLBC0_MLBLK_Pos)) /* Assigment of value for MLBLK in the MLB_MLBC0 register */
#define MLB_MLBC0_ASYRETRY_Pos                _UINT32_(12)                                         /* (MLB_MLBC0) Asynchronous Tx packet retry Position */
#define MLB_MLBC0_ASYRETRY_Msk                (_UINT32_(0x1) << MLB_MLBC0_ASYRETRY_Pos)            /* (MLB_MLBC0) Asynchronous Tx packet retry Mask */
#define MLB_MLBC0_ASYRETRY(value)             (MLB_MLBC0_ASYRETRY_Msk & (_UINT32_(value) << MLB_MLBC0_ASYRETRY_Pos)) /* Assigment of value for ASYRETRY in the MLB_MLBC0 register */
#define MLB_MLBC0_CTLRETRY_Pos                _UINT32_(14)                                         /* (MLB_MLBC0) Control Tx packet retry Position */
#define MLB_MLBC0_CTLRETRY_Msk                (_UINT32_(0x1) << MLB_MLBC0_CTLRETRY_Pos)            /* (MLB_MLBC0) Control Tx packet retry Mask */
#define MLB_MLBC0_CTLRETRY(value)             (MLB_MLBC0_CTLRETRY_Msk & (_UINT32_(value) << MLB_MLBC0_CTLRETRY_Pos)) /* Assigment of value for CTLRETRY in the MLB_MLBC0 register */
#define MLB_MLBC0_FCNT_Pos                    _UINT32_(15)                                         /* (MLB_MLBC0) Number of frames per sub-buffer (synchronous channels) Position */
#define MLB_MLBC0_FCNT_Msk                    (_UINT32_(0x7) << MLB_MLBC0_FCNT_Pos)                /* (MLB_MLBC0) Number of frames per sub-buffer (synchronous channels) Mask */
#define MLB_MLBC0_FCNT(value)                 (MLB_MLBC0_FCNT_Msk & (_UINT32_(value) << MLB_MLBC0_FCNT_Pos)) /* Assigment of value for FCNT in the MLB_MLBC0 register */
#define MLB_MLBC0_Msk                         _UINT32_(0x0003D0BD)                                 /* (MLB_MLBC0) Register Mask  */


